uhnp/src/Enums/ВидыСтавокОбъектовФинансовогоХарактера/ВидыСтавокОбъектовФинансовогоХарактера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокОбъектовФинансовогоХарактера</name>
  <enumValues>
    <name>ЭффективнаяСтавка</name>
  </enumValues>
  <enumValues>
    <name>СтавкаПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>РыночнаяСтавка</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыСтавокОбъектовФинансовогоХарактера/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьДанныеВыбораСтавки();
	
КонецПроцедуры

Функция ПолучитьДанныеВыбораСтавки()

 	ДоступныеЗначения = Новый СписокЗначений;
		
	//все кроме Удалить_СтавкаДисконтирования
	
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.РыночнаяСтавка);
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.СтавкаПоДоговору);
	ДоступныеЗначения.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка);
	
	Возврат ДоступныеЗначения;

КонецФункции
